## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [1]:
# Kelvin Waters
# Online FT 12/09/19 cohort
# Once submitted
# Rafael Carrasco

In [2]:
# import everything being used up top
import os, sqlite3
import numpy as np
import pandas as pd
from glob import glob

In [3]:
csv_files = glob("zippedData/*.csv")
csv_files

['zippedData\\bom.movie_gross.csv',
 'zippedData\\name.basics.csv',
 'zippedData\\title.akas.csv',
 'zippedData\\title.basics.csv',
 'zippedData\\title.crew.csv',
 'zippedData\\title.principals.csv',
 'zippedData\\title.ratings.csv',
 'zippedData\\tmdb.movies.csv',
 'zippedData\\tn.movie_budgets.csv']

In [4]:
csv_files_dict = {}
for filename in csv_files:
    filename_cleaned = os.path.basename(filename).replace(".csv", "").replace(".", "_")
    filename_df = pd.read_csv(filename, index_col= 0)
    csv_files_dict[filename_cleaned] = filename_df

In [5]:
conn = sqlite3.connect("movies_db.sqlite")
#df_tmdb_movies.to_sql("tmdb_movies", conn)

In [6]:
def create_sql_table_from_df(df, name, conn):
    try:
        df.to_sql(name, conn)
        print(f"Created table {name}")
    except Exception as e:
        print(f"couldn't make table {name}")
        print(e)

In [7]:
for name, table in csv_files_dict.items():
    create_sql_table_from_df(table, name, conn)

Created table bom_movie_gross
Created table name_basics
Created table title_akas
Created table title_basics
Created table title_crew
Created table title_principals
Created table title_ratings
Created table tmdb_movies
Created table tn_movie_budgets

In [8]:
with open("./.gitignore", "w+") as f:
    f.write("*.sqlite") # put files you want to ignore here
    f.write("\n") # insert a new line after each file
    f.write("zippedData/")
    f.write("\n")
    f.write("zippedData/*.csv")
    f.write("\n")
    f.write("zippedData/*.gz")

# let the fun begin

In [9]:
# verifying movies_db was created
ls

 Volume in drive C has no label.
 Volume Serial Number is DC38-3E46

 Directory of C:\Users\kelvi\flatiron\section01\dsc-mod-1-project-v2-1-online-ds-ft-120919

01/14/2020  06:19 PM    <DIR>          .
01/14/2020  06:19 PM    <DIR>          ..
01/14/2020  06:19 PM                56 .gitignore
01/13/2020  02:36 PM    <DIR>          .ipynb_checkpoints
01/13/2020  02:34 PM                93 .learn
01/13/2020  02:34 PM         1,425,341 awesome.gif
01/13/2020  02:34 PM             1,846 CONTRIBUTING.md
01/13/2020  02:34 PM             1,357 LICENSE.md
01/13/2020  02:34 PM            78,619 module1_project_rubric.pdf
01/14/2020  06:19 PM       183,136,256 movies_db.sqlite
01/13/2020  02:34 PM            12,713 README.md
01/14/2020  06:18 PM             3,504 student.ipynb
01/14/2020  05:57 PM    <DIR>          zippedData
               9 File(s)    184,659,785 bytes
               4 Dir(s)  753,734,746,112 bytes free

In [15]:
# sqlite connection established
# cursor obj instantiated
conn = sqlite3.connect('movies_db.sqlite')
c = conn.cursor()

c.execute("""SELECT name 
        FROM sqlite_master 
        WHERE type = 'table'
        """)
c.fetchall()

[('bom_movie_gross',),
 ('name_basics',),
 ('title_akas',),
 ('title_basics',),
 ('title_crew',),
 ('title_principals',),
 ('title_ratings',),
 ('tmdb_movies',),
 ('tn_movie_budgets',)]

# Manipulate each table in place for efficiency

In [80]:
# RangeIndex: 3387 entries, 0 to 3386
# Data columns (total 5 columns):
# title             3387 non-null object
# studio            3382 non-null object
# domestic_gross    3359 non-null float64
# foreign_gross     2037 non-null object
# year              3387 non-null int64
# dtypes: float64(1), int64(1), object(3)
# df.shape (3387, 5)
c.execute("""SELECT *
        FROM bom_movie_gross
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,None,2018
3383,Edward II (2018 re-release),FM,4800.0,None,2018
3384,El Pacto,Sony,2500.0,None,2018
3385,The Swan,Synergetic,2400.0,None,2018
3386,An Actor Prepares,Grav.,1700.0,None,2018

In [78]:
# RangeIndex: 606648 entries, 0 to 606647
# Data columns (total 6 columns):
# nconst                606648 non-null object
# primary_name          606648 non-null object
# birth_year            82736 non-null float64
# death_year            6783 non-null float64
# primary_profession    555308 non-null object
# known_for_titles      576444 non-null object
# dtypes: float64(2), object(4)
# df.shape (606648, 6)
c.execute("""SELECT *
        FROM name_basics
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,None
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,None
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [61]:
# RangeIndex: 331703 entries, 0 to 331702
# Data columns (total 8 columns):
# title_id             331703 non-null object
# ordering             331703 non-null int64
# title                331703 non-null object
# region               278410 non-null object
# language             41715 non-null object
# types                168447 non-null object
# attributes           14925 non-null object
# is_original_title    331678 non-null float64
# dtypes: float64(1), int64(1), object(6)
# df.shape (331703, 8)
c.execute("""SELECT *
        FROM title_akas
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

In [63]:
# RangeIndex: 146144 entries, 0 to 146143
# Data columns (total 6 columns):
# tconst             146144 non-null object
# primary_title      146144 non-null object
# original_title     146123 non-null object
# start_year         146144 non-null int64
# runtime_minutes    114405 non-null float64
# genres             140736 non-null object
# dtypes: float64(1), int64(1), object(4)
# df.shape (146144, 6)
c.execute("""SELECT *
        FROM title_basics
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [65]:
# RangeIndex: 146144 entries, 0 to 146143
# Data columns (total 3 columns):
# tconst       146144 non-null object
# directors    140417 non-null object
# writers      110261 non-null object
# dtypes: object(3)
# df.shape (146144, 3)
c.execute("""SELECT *
        FROM title_crew
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

           tconst                      directors              writers
0       tt0285252                      nm0899854            nm0899854
1       tt0438973                           None  nm0175726,nm1802864
2       tt0462036                      nm1940585            nm1940585
3       tt0835418                      nm0151540  nm0310087,nm0841532
4       tt0878654  nm0089502,nm2291498,nm2292011            nm0284943
...           ...                            ...                  ...
146139  tt8999974                     nm10122357           nm10122357
146140  tt9001390                      nm6711477            nm6711477
146141  tt9001494          nm10123242,nm10123248                 None
146142  tt9004986                      nm4993825            nm4993825
146143  tt9010172                           None            nm8352242

[146144 rows x 3 columns]

In [68]:
# RangeIndex: 1028186 entries, 0 to 1028185
# Data columns (total 6 columns):
# tconst        1028186 non-null object
# ordering      1028186 non-null int64
# nconst        1028186 non-null object
# category      1028186 non-null object
# job           177684 non-null object
# characters    393360 non-null object
# dtypes: int64(1), object(5)
# df.shape (1028186, 6)
c.execute("""SELECT *
        FROM title_principals
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,tconst,ordering,nconst,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

In [70]:
# RangeIndex: 3387 entries, 0 to 3386
# Data columns (total 5 columns):
# title             3387 non-null object
# studio            3382 non-null object
# domestic_gross    3359 non-null float64
# foreign_gross     2037 non-null object
# year              3387 non-null int64
# dtypes: float64(1), int64(1), object(3)
# df.shape (3387, 5)
c.execute("""SELECT *
        FROM bom_movie_gross
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,None,2018
3383,Edward II (2018 re-release),FM,4800.0,None,2018
3384,El Pacto,Sony,2500.0,None,2018
3385,The Swan,Synergetic,2400.0,None,2018
3386,An Actor Prepares,Grav.,1700.0,None,2018

In [72]:
# RangeIndex: 73856 entries, 0 to 73855
# Data columns (total 3 columns):
# tconst           73856 non-null object
# averagerating    73856 non-null float64
# numvotes         73856 non-null int64
# dtypes: float64(1), int64(1), object(1)
# df.shape (76856, 3)
c.execute("""SELECT *
        FROM title_ratings
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [74]:
# RangeIndex: 26517 entries, 0 to 26516
# Data columns (total 10 columns):
# index                26517 non-null int64
# genre_ids            26517 non-null object
# id                   26517 non-null int64
# original_language    26517 non-null object
# original_title       26517 non-null object
# popularity           26517 non-null float64
# release_date         26517 non-null object
# title                26517 non-null object
# vote_average         26517 non-null float64
# vote_count           26517 non-null int64
# dtypes: float64(2), int64(3), object(5)
# df.shape (26517, 10)
c.execute("""SELECT *
        FROM tmdb_movies
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,index,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [76]:
# RangeIndex: 5782 entries, 0 to 5781
# Data columns (total 6 columns):
# id                   5782 non-null int64
# release_date         5782 non-null object
# movie                5782 non-null object
# production_budget    5782 non-null object
# domestic_gross       5782 non-null object
# worldwide_gross      5782 non-null object
# dtypes: int64(1), object(5)
# df.shape (5782, 6)
c.execute("""SELECT *
        FROM tn_movie_budgets
        """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"